test/assets/all_near_me_request

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><AllNearMe xmlns="http://ws.dgjobsservice.info/"><search><AuthenticationKey>TESTING</AuthenticationKey><UniqueIdentifier>1</UniqueIdentifier><MaximumNumberOfResults>100</MaximumNumberOfResults><IncludeNationalVacancies>true</IncludeNationalVacancies><IncludeRegionalVacancies>true</IncludeRegionalVacancies><Temporary>true</Temporary><Permanent>true</Permanent><PartTime>true</PartTime><FullTime>true</FullTime><MaxAge>28</MaxAge><Location><Latitude>51.0</Latitude><Longitude>1.0</Longitude></Location><Radius>50</Radius></search></AllNearMe></soap:Body></soap:Envelope>